[
  {
    "youtubeId": "gu5r1EWSDSU",
    "url": "https://www.youtube.com/watch?v=gu5r1EWSDSU",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 1",
    "description": "Let's kick off our series of live streams in 2024 with something that's been much requested - a back to basics series on CAP with Node.js!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-1/ev-p/310513 for all resource links.\n\n*Summary*\nMade with HARPA AI\n\n- [03:40](https://youtu.be/gu5r1EWSDSU?t=220s) 🎉 Introduction to the live stream in 2024\n  - DJ Adams welcomes viewers to the first live stream of 2024.\n  - He acknowledges the audience and talks about his recent flu.\n  - DJ Adams introduces his new location, a narrow boat, and shows the setup.\n\n- [07:54](https://youtu.be/gu5r1EWSDSU?t=474s) 📺 Overview of the series and setup for local development\n  - DJ Adams discusses the new series focusing on SAP Cloud Application Programming Model (CAP).\n  - He explains the goal of going back to basics and helping viewers understand CAP.\n  - DJ Adams outlines the minimal requirements for following along, which are VS Code and a container engine.\n\n- [27:35](https://youtu.be/gu5r1EWSDSU?t=1655s) 🤖 Difference between a service and an app in CAP:\n  - Understanding the distinction between services and apps in CAP.\n  \n- [28:06](https://youtu.be/gu5r1EWSDSU?t=1686s) 🛡️ Installing necessary development tools for CAP:\n  - Installing curl, git, and SQL light 3, essential tools for CAP development.\n  \n- [28:52](https://youtu.be/gu5r1EWSDSU?t=1732s) 💼 Introduction to npm and SAP npm packages:\n  - Explaining npm as a package manager for Node.js and SAP npm packages for CAP development.\n  \n- [29:34](https://youtu.be/gu5r1EWSDSU?t=1774s) 🚀 Difference between SAP CDs and SAP CDs DK:\n  - Distinguishing between SAP CDs (runtime) and SAP CDs DK (development kit) for CAP development.\n  \n- [30:14](https://youtu.be/gu5r1EWSDSU?t=1814s) 🌐 Overview of CAP development hierarchy:\n\n  - Exploring the hierarchy of CAP development folders: app, serve, and DB.\n  \n- [31:10](https://youtu.be/gu5r1EWSDSU?t=1870s) 📦 SAP Cloud Application Programming Model (CAP) packages:\n  - Understanding the purpose of SAP CAP packages for runtime and development.\n  \n- [32:08](https://youtu.be/gu5r1EWSDSU?t=1928s) 🔄 The role of npm packages in CAP development:\n  - Highlighting the significance of npm packages for CAP development.\n  \n- [33:41](https://youtu.be/gu5r1EWSDSU?t=2021s) 🔌 Exposing Port 404 for CAP development:\n  - Explaining the importance of exposing Port 404 for accessing CAP applications locally.\n  \n- [47:29](https://youtu.be/gu5r1EWSDSU?t=2849s) 🧰 Setting up CAP development environment in VS Code:\n  - Demonstrating how to set up a CAP development environment using VS Code and Dev Containers.\n  \n- [49:25](https://youtu.be/gu5r1EWSDSU?t=2965s) 🚀 Installing development tools in the container:\n  - Highlighting the installation of essential development tools inside the Dev Container for CAP development.\n\n- [50:36](https://youtu.be/gu5r1EWSDSU?t=3036s) 🛠️ Setting up a development environment in a container.\n  - Docker container setup with CAP and Node.js.\n  - Exploring packages installed in the container.\n  - Introduction to CD SDK.\n\n- [52:12](https://youtu.be/gu5r1EWSDSU?t=3132s) 🧙‍♂️ The power of CAP with the CDs command line tool.\n  - Explanation of using the CDs command line tool.\n  - CAP development capabilities at your fingertips.\n  - The benefits of a consistent development environment in a container.\n\n- [54:53](https://youtu.be/gu5r1EWSDSU?t=3293s) 📚 Back to basics with CAP - Multi-episode series.\n  - Announcing a multi-episode series on CAP.\n  - Exploring the basics of CAP together.\n  - Encouraging viewer participation in learning CAP.",
    "publishedAt": "2024-01-12T21:10:44Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultAudioLanguage": "en",
    "viewCount": "22306",
    "likeCount": "380",
    "commentCount": "38",
    "duration": "PT1H6M5S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.023Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 1\n[Watch the video here!](https://www.youtube.com/watch?v=gu5r1EWSDSU)\n\nIn this live coding session, DJ Adams explores the SAP Cloud Application Programming Model (CAP). Participants can learn about the basics of CAP, OData services, and local development setups while interacting with an engaging community.\n\n### Main Topic\n**Main Topics Covered:**\n- [2m0s](https://www.youtube.com/watch?v=gu5r1EWSDSU&t=2m0s): Introduction to the live stream and SAP ecosystem\n- [12m6s](https://www.youtube.com/watch?v=gu5r1EWSDSU&t=12m6s): Overview of CAP and its significance\n- [16m56s](https://www.youtube.com/watch?v=gu5r1EWSDSU&t=16m56s): Setting up the environment for local development\n- [22m31s](https://www.youtube.com/watch?v=gu5r1EWSDSU&t=22m31s): Discussion on databases in CAP\n- [54m10s](https://www.youtube.com/watch?v=gu5r1EWSDSU&t=54m10s): First CAP application setup and service definition\n\n### Content\nDJ dives into hands-on coding with SAP CAP, highlighting the importance of starting from basics, especially for newcomers to the framework. He introduces the fundamental concepts and tools necessary for local development, including Node.js, Visual Studio Code, and Docker. Throughout the session, viewers can expect demonstrations of how to create applications using CAP, such as setting up a generic bookshop application. DJ’s approach emphasizes dispelling fears about getting started and encouraging community interaction for questions and clarifications.\n\n### DJ's private life\nDJ shares details about his recovery from flu while living on a narrowboat in the UK, shedding light on his unique lifestyle and current setup for live streaming.\n\n### Chat\nThe audience is actively participating in the chat, providing insights and asking questions pertinent to coding concepts and setups. DJ is fostering an interactive atmosphere where no question is too silly, and community engagement is a crucial element of the stream."
  },
  {
    "youtubeId": "8N2TxgZ9bjY",
    "url": "https://www.youtube.com/watch?v=8N2TxgZ9bjY",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 2",
    "description": "In this episode 2 of our series, we continue to explore the basics of CAP with Node.js. This time we dig into the detail of what happens with cds init, cds add and cds watch. \n\n🌎 See https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-2/ev-p/311695 for all resource links.\n\n*Summary* \nGenerated by AI\n\n- [01:58] 👋 Introduction and Greetings\n  - DJ welcomes the audience and greets them.\n\n- [02:23] 📺 Episode Introduction\n  - DJ introduces the second episode of the \"Back to Basics with SAP Cloud Application Programming Model (CAP)\" series.\n\n- [03:19] 📱 Experiment with Camera Setup\n  - DJ explains an experiment with his camera setup and mentions his colleague AJ joining the session.\n\n- [04:43] 🗺️ Series Overview and Approach\n  - DJ outlines the series' purpose: a gentle exploration of CAP basics, emphasizing understanding.\n\n- [05:25] 🏃 DJ's Health Update\n  - DJ briefly updates on his health and mentions his morning run.\n\n- [07:16] 📦 Using Dev Containers with CAP\n  - DJ talks about using development containers with CAP and mentions a blog post he wrote.\n\n- [09:08] 📰 SAP Developer News\n  - DJ shares information about the SAP Developer News and mentions a blog post by Riley Rainey.\n\n- [10:32] 💡 Planning for the Session\n  - DJ discusses the plan for the session, which includes exploring CAP commands.\n\n- [12:06] 👩‍💻 Opening VS Code and Dev Containers\n  - DJ opens VS Code and explains the process of using Dev Containers.\n\n- [13:15] ⚙️ Exploring `cds init`\n  - DJ explains the `cds init` command and its purpose in initializing a CAP project.\n\n- [14:12] 💬 Audience Discussion on Language Preferences\n  - DJ briefly discusses language preferences, mentioning both Java and JavaScript.\n\n- [16:04] 📁 Directory Structure in Initialized Project\n  - DJ explores the directory structure created by the `cds init` command.\n\n- [17:23] 🤔 Questions about `.eslintrc` and `.gitignore`\n  - DJ asks the audience for insights into the purposes of `.eslintrc` and `.gitignore` files.\n\n- [19:32] 🔒 Purpose of `.gitignore`\n  - Stefano explains that `.gitignore` is used to specify files that should not be included in the Git repository.\n\n- [20:58] 🐚 Overview of app components and local development\n  - App components created on the local file system.\n  - Development within a container context.\n  - Importance of not storing data inside containers.\n\n- [22:36] 📜 Understanding git and GitHub\n  - Differentiating between git and GitHub.\n  - Explaining the purpose of .gitignore in ignoring files for git.\n  - Highlighting the significance of not storing sensitive data in repositories.\n\n- [26:10]🧹 Introduction to ESLint and linting in JavaScript\n  - Discussing ESLint as a linting tool for JavaScript.\n  - Explaining the role of ESLint in catching compile-time errors and enforcing code style.\n  - Mentioning the importance of setting rules for code quality.\n\n- [29:56] 🚀 Integration of ESLint with SAP CAP\n  - Introducing the integration of ESLint with SAP Cloud Application Programming Model (CAP).\n  - Highlighting the purpose of ESLint rules specific to CAP development.\n  - Exploring how ESLint checks CAP code against defined rules.\n\n- [32:41] 📁 Explanation of RC Files and Hidden Files\n  - Clarifying the historical significance of RC files in Unix.\n  - Describing the naming convention of RC files for configuration.\n  - Discussing the use of hidden files (files starting with a dot) in Unix-like systems.\n\n- [38:08] 📂 Understanding the Purpose of 'DB' and 'Serve' Directories in CAP\n  - Explaining the purpose of 'DB' and 'Serve' directories in SAP CAP.\n  - Distinguishing between the persistence layer (DB) and service layer (Serve).\n  - Highlighting the need for separation in defining entities, services, and data exposure in CAP.\n\n- [41:04] 📦 Overview of project structure\n  - Project structure includes directories like `db`, `srv`, `app`, and others.\n  - CDS language encourages reusable and modularized definitions for projects.\n  - Explanation of directories like `cds`, `eslintrc`, and `package.json`.\n\n- [43:06] 📝 Understanding package.json\n  - Package.json contains project metadata, dependencies, and scripts.\n  - Differentiating between dependencies and dev dependencies.\n  - The significance of the \"scripts\" section, including \"npm start\" for starting the service.\n\n- [46:05] 🛠️ Design time vs. runtime dependencies\n  - Explains the difference between design time and runtime dependencies.\n  - Design time tools like watchers and auto restarters are not needed in production.\n \n- [49:45] 🧩 Adding features with \"CDS add\"\n  - Demonstrates how to add features to a project using \"CDS add.\"\n  - Shows the addition of a tiny sample feature and its impact on the project structure.\n\n- [55:44] 🧹 Linting with \"CDS lint\"\n  - Introduces linting for a CAP project using \"CDS lint.\"\n\n- [01:02:55] 🗃️ Locating the global installation of SAP CDS DK\n  - Explains how to find the global installation path of SAP CDS DK.",
    "publishedAt": "2024-01-19T21:12:42Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultAudioLanguage": "en",
    "viewCount": "8652",
    "likeCount": "126",
    "commentCount": "21",
    "duration": "PT1H4M15S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.086Z",
    "summary": "# Summary of DJ Adams' Live Coding Session\nWatch the full session here: [Back to basics with SAP Cloud Application Programming Model (CAP) - part 2](https://www.youtube.com/watch?v=8N2TxgZ9bjY)\n\nIn this live coding session, DJ Adams engages with his audience while exploring the basics of the SAP Cloud Application Programming (CAP) model. Throughout the hour, viewers can learn various concepts related to CAP, including practical coding techniques and updates from the SAP ecosystem.\n\n## Main Topic\nParticipants gain insights into the SAP CAP framework, especially focusing on:\n- **OData and its integration features** [5m1s](https://www.youtube.com/watch?v=8N2TxgZ9bjY&t=5m1s)\n- **Using CAP with Node.js and Docker** [8m3s](https://www.youtube.com/watch?v=8N2TxgZ9bjY&t=8m3s)\n- **Setting up development containers** [9m46s](https://www.youtube.com/watch?v=8N2TxgZ9bjY&t=9m46s)\n- **Best practices in JavaScript coding** [10m10s](https://www.youtube.com/watch?v=8N2TxgZ9bjY&t=10m10s)\n- **Using ESLint for code quality** [27m31s](https://www.youtube.com/watch?v=8N2TxgZ9bjY&t=27m31s)\n\n## Content\nThe session elaborates on the SAP CAP framework, particularly its capabilities in developing applications using Node.js and Docker. DJ demonstrates how to configure a development environment using the CAP tools and showcases practical examples like initializing projects and managing dependencies with npm. He also dives into the usage of ESLint for enforcing code quality standards and discusses integrating features into existing CAP applications.\n\n## DJ's Private Life\nDJ shares a personal update, emphasizing his progress in health and mentioning his routine of running as part of his wellness journey, which allows him to engage more energetically with his viewers [5m1s](https://www.youtube.com/watch?v=8N2TxgZ9bjY&t=5m1s).\n\n## Chat\nThe chat is lively, with viewers asking questions and sharing their experiences with coding in CAP. DJ encourages participation and responds to various inquiries, enriching the interaction within the stream. He emphasizes the importance of community engagement, acknowledging insightful comments from viewers about Java vs. JavaScript and discussing preferred languages for development."
  },
  {
    "youtubeId": "mTvjAthGjBg",
    "url": "https://www.youtube.com/watch?v=mTvjAthGjBg",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 3",
    "description": "In this episode 3 of our series, we continue to explore the basics of CAP with Node.js. We pick up where we left off last time, and investigate starting up a basic CAP server with cds watch to discover the amazing features that it gives us. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-3/ec-p/13582522#M410 for all resource links.",
    "publishedAt": "2024-02-02T21:07:48Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultAudioLanguage": "en",
    "viewCount": "5695",
    "likeCount": "109",
    "commentCount": "20",
    "duration": "PT1H2M25S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.159Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 3 \n\nIn this exciting live coding session, DJ Adams focuses on SAP's Cloud Application Programming Model (CAP), diving deep into its functionalities while interacting with viewers on YouTube. The session promises insights into the latest developments within the SAP ecosystem and offers practical coding tips.\n\n**Main Topics Covered:**\n- Overview of [OData](https://www.youtube.com/watch?v=mTvjAthGjBg&t=18m35s) and its integration with CAP.\n- Exploration of the [CDS SDK 7.6](https://www.youtube.com/watch?v=mTvjAthGjBg&t=11m16s).\n- Live coding techniques with [linting tools](https://www.youtube.com/watch?v=mTvjAthGjBg&t=9m15s) for code quality checks.\n- Using [CDS commands](https://www.youtube.com/watch?v=mTvjAthGjBg&t=30m26s) like run, serve, and watch in development.\n- Understanding the differences between functions and actions in OData services.\n\n## Content \nDJ delves into SAP CAP, discussing how to leverage its latest features along with OData. He highlights the importance of using the `cds` command line interface for creating and managing services. The live coding involves setting up a project, implementing OData functionality, and troubleshooting common issues. DJ explains how to utilize linting tools to maintain code quality and introduces variations in service definitions, including using `cds watch` to observe live changes in the development environment. \n\n## DJ's private life\nDJ also shares a bit about his personal battle with a cold, illustrating an authentic side to his professional presence, while juxtaposing personal anecdotes with technical discussions.\n\n## Chat\nThroughout the session, the chat remains lively with viewers asking questions, sharing feedback, and offering insights. DJ encourages interactive participation, which enhances the viewer experience by addressing specific queries and adapting his coding pace based on feedback from the audience. \n\nFor those interested in deepening their knowledge of SAP CAP, this session conveys practical insights while showcasing DJ's expertise in an engaging manner!"
  },
  {
    "youtubeId": "1ywiOaGVA5w",
    "url": "https://www.youtube.com/watch?v=1ywiOaGVA5w",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 4",
    "description": "In this episode 4 of our series, we continue to explore the basics of CAP with Node.js, digging deeper into cds watch and how we can manage our CDS definitions. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-4/ec-p/13600391/highlight/true#M434 for all resource links.",
    "publishedAt": "2024-02-09T21:08:57Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "4685",
    "likeCount": "101",
    "commentCount": "9",
    "duration": "PT1H2M55S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.228Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 4\n\nIn this session of Live Coding with DJ Adams, the main topic focuses on the SAP Cloud Application Programming Model (CAP) and OData. Viewers can learn about building simple services and utilizing CAP’s conventions effectively in their applications.\n\n### Main Topics Covered:\n- [2m24s](https://www.youtube.com/watch?v=1ywiOaGVA5w&t=2m24s): Introduction to the CAP framework\n- [10m3s](https://www.youtube.com/watch?v=1ywiOaGVA5w&t=10m3s): Discussion on the naming conventions for CAP packages\n- [11m15s](https://www.youtube.com/watch?v=1ywiOaGVA5w&t=11m15s): Open Telemetry plugin for CAP\n- [48m14s](https://www.youtube.com/watch?v=1ywiOaGVA5w&t=48m14s): Transition from basic service creation to using entity definitions\n\n### Content\nDJ dives into the key aspects of CAP, demonstrating how to define a simple service and the associated entities. He highlights the importance of adherence to naming conventions, such as using plural forms for entities, and emphasizes how these conventions simplify development. The session also covers the integration of data from CSV files into the service and explores the opinionated nature of CAP, which helps streamline the programming process for developers by providing clear guidelines.\n\n### DJ's Private Life\nDuring the stream, DJ shares updates about his travels, detailing a challenging 13-hour journey back from Poland. He discusses his current work environment at a marina and notes his plans to travel further in the coming weeks.\n\n### Chat\nViewers actively participate in the chat, asking questions about the CAP framework and sharing their thoughts on the series' pacing. Many appreciate the conversational style, indicating that it aids understanding, while others suggest a desire for a faster exploration of technical content. DJ engages with the audience, demonstrating a strong interactive component to the live coding session."
  },
  {
    "youtubeId": "fgqnptEgUW4",
    "url": "https://www.youtube.com/watch?v=fgqnptEgUW4",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 5",
    "description": "In this episode, we look more into basic CDS service and entity definitions, and dig into aspects, types, CDS compilation to EDMX and SQL, and look at how we get a fully fledged OData V4 service, with all the OData operations handled, with no effort. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-5/ec-p/13600538#M436 for all resource links.",
    "publishedAt": "2024-02-16T21:08:59Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "4420",
    "likeCount": "72",
    "commentCount": "17",
    "duration": "PT1H2M21S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.285Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 5\n\nIn this live coding session, DJ Adams provides an engaging overview of the SAP Cloud Application Programming Model (CAP). The session covers essential coding concepts and practical demonstrations, allowing viewers to enhance their understanding of CAP, including its integration with OData and the latest developments in the SAP ecosystem.\n\n**Main Topics Covered:**\n- Introduction to CAP and its plugins [2m0s](https://www.youtube.com/watch?v=fgqnptEgUW4&t=2m0s)\n- Working with business application studio [6m30s](https://www.youtube.com/watch?v=fgqnptEgUW4&t=6m30s)\n- Explanation of Universal IDs (CUID) in data modeling [13m10s](https://www.youtube.com/watch?v=fgqnptEgUW4&t=13m10s)\n- Leveraging managed aspects in entity definitions [19m55s](https://www.youtube.com/watch?v=fgqnptEgUW4&t=19m55s)\n- How to handle and troubleshoot data loading errors [24m25s](https://www.youtube.com/watch?v=fgqnptEgUW4&t=24m25s)\n- Creating, reading, and deleting entities in OData [55m35s](https://www.youtube.com/watch?v=fgqnptEgUW4&t=55m35s)\n\n## Content\nDJ dives deep into SAP CAP, emphasizing the role of CUID in simplifying IDs in data modeling and how aspects can enhance entity definitions by automatically handling common attributes like creation and modification timestamps. He elaborates on using business application studio for model compilation and interacting with OData services, discussing compilation to SQL and EDMX formats while highlighting the flexibility of CAP in interfacing with databases.\n\n## DJ's private life\nDuring the stream, DJ shares his personal anecdotes, including moments of panic before the live session and his casual interactions with viewers about his morning routine.\n\n## Chat\nThroughout the live stream, DJ interacts with viewers in the chat, addressing their questions and comments. Viewers not only ask for clarifications on technical topics but also share their experiences and insights, contributing to a collaborative learning environment."
  },
  {
    "youtubeId": "NZj7Q4LBotA",
    "url": "https://www.youtube.com/watch?v=NZj7Q4LBotA",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 6",
    "description": "In this episode, we head back to our CDS definitions, stare at the cuid aspect and what it implies, and then start improving our Books and Authors entity definitions. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-6/ec-p/13616909/highlight/true#M471 for all resource links.",
    "publishedAt": "2024-02-23T21:10:28Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "4053",
    "likeCount": "72",
    "commentCount": "16",
    "duration": "PT1H1M55S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.347Z",
    "summary": "# Summary of DJ Adams' Live Coding Session\n\nIn this live coding session, DJ Adams explores the SAP Cloud Application Programming Model (CAP) while engaging with his YouTube audience. Throughout the stream, viewers can learn practical coding techniques and gain insights into the latest developments in the SAP ecosystem.\n\n**Main Topics Covered:**\n- [6m17s](https://www.youtube.com/watch?v=NZj7Q4LBotA&t=6m17s): SAP Developer News and new co-talk series.\n- [10m9s](https://www.youtube.com/watch?v=NZj7Q4LBotA&t=10m9s): OData operations like queries, reads, creates, and deletes.\n- [18m50s](https://www.youtube.com/watch?v=NZj7Q4LBotA&t=18m50s): Discussion about GUIDs and best practices concerning unique identifiers.\n- [28m54s](https://www.youtube.com/watch?v=NZj7Q4LBotA&t=28m54s): Introduction to using SQL-like databases with Docker deployments.\n- [35m19s](https://www.youtube.com/watch?v=NZj7Q4LBotA&t=35m19s): Persistence challenges when using in-memory databases.\n\n## Content\nDJ delves into the SAP CAP framework, emphasizing OData operations, and explores how to implement GUIDs correctly to ensure scalability and standard compliance in applications. He provides valuable insights on using the multi-target application builder tool (MBT) and shares lesson-based experiences from his development journey. He discusses how to transition from in-memory databases to persistent systems like SQL for a more robust production setup.\n\n## DJ's Private Life\nIn a lighthearted moment, DJ shares a humorous account of running into a hailstorm during his morning jog, which made for an interesting reference to the day's session.\n\n## Chat\nViewers actively participated in the chat, providing feedback, asking questions about SAP tools, and sharing their own coding experiences. DJ appreciated the engagement and made several references to viewer comments to deepen the discussion and clarify points. \n\nWatch the full session here: [Back to basics with SAP Cloud Application Programming Model (CAP) - part 6](https://www.youtube.com/watch?v=NZj7Q4LBotA)"
  },
  {
    "youtubeId": "kgycosxv9aQ",
    "url": "https://www.youtube.com/watch?v=kgycosxv9aQ",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 7",
    "description": "In this episode, we look more closely at the Country type, and use that as a springboard to start exploring managed associations. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-7/ec-p/13626739#M477 for all resource links.",
    "publishedAt": "2024-03-08T21:10:23Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "3287",
    "likeCount": "49",
    "commentCount": "7",
    "duration": "PT1H1M30S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.404Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 7\n\nIn this live coding session, DJ Adams delves into the SAP Cloud Application Programming (CAP) model, focusing on coding practices and the latest developments within the SAP ecosystem. The audience is encouraged to engage, ask questions, and share insights during the session.\n\n**Main Topics Covered:**\n- [1m58s](https://www.youtube.com/watch?v=kgycosxv9aQ&t=1m58s): Overview of the session\n- [6m19s](https://www.youtube.com/watch?v=kgycosxv9aQ&t=6m19s): Latest SAP developer news\n- [8m21s](https://www.youtube.com/watch?v=kgycosxv9aQ&t=8m21s): OData and entity relationships\n- [29m4s](https://www.youtube.com/watch?v=kgycosxv9aQ&t=29m4s): Country of birth as an entity type\n- [49m7s](https://www.youtube.com/watch?v=kgycosxv9aQ&t=49m7s): Using associations for entity relationships\n\n## Content\n\nDJ demonstrates how to use the CAP model to create and manage entities, specifically exploring how to implement associations for entities such as authors and books. He explains the significance of the country element in establishing relations between data. The session covers practical coding examples, including how to define entity types and manage their properties, showcasing the use of SAP CDS (Core Data Services) for efficient data handling.\n\n## DJ's Private Life\n\nDJ takes a moment to share reflections from his personal life, discussing his running experiences and adventures during winter mornings. These snippets add a relatable touch to the session, reminding viewers of the blend between professional and personal pursuits.\n\n## Chat\n\nThroughout the live session, viewers actively participated in the chat by asking questions and commenting on various topics. DJ engaged with the audience by reading their messages and responding to inquiries, creating an interactive learning environment.\n\nFor further details, you can watch the full session [here](https://www.youtube.com/watch?v=kgycosxv9aQ)."
  },
  {
    "youtubeId": "8BMASRcs0Hg",
    "url": "https://www.youtube.com/watch?v=8BMASRcs0Hg",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 8",
    "description": "In this episode, we can now turn our attention to understanding how to define a managed association for our own entities. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nSee https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-8/ec-p/13639548/highlight/true#M517 for all resource links.",
    "publishedAt": "2024-03-15T21:30:18Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "3750",
    "likeCount": "75",
    "commentCount": "11",
    "duration": "PT1H1M46S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.464Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 8\n[Watch the video here](https://www.youtube.com/watch?v=8BMASRcs0Hg)\n\nIn this live coding session, DJ Adams explores the SAP Cloud Application Programming Model (CAP) and addresses various coding concepts, specifically focusing on the usage of OData services. The series aims to provide viewers with a solid understanding of CAP while fostering an engaging community through chat interactions.\n\n**Main Topics Covered:**\n- [2m56s](https://www.youtube.com/watch?v=8BMASRcs0Hg&t=2m56s): Overview of SAP CAP.\n- [10m5s](https://www.youtube.com/watch?v=8BMASRcs0Hg&t=10m5s): Discussed reuse types and common data.\n- [33m10s](https://www.youtube.com/watch?v=8BMASRcs0Hg&t=33m10s): Configuration profiles in CAP.\n- [50m1s](https://www.youtube.com/watch?v=8BMASRcs0Hg&t=50m1s): Managed associations between books and authors.\n  \n### Content\nThe session delves into SAP CAP's structure, particularly focusing on defining services and how they connect with databases. DJ guides viewers on utilizing common content packages to inject standard data types like country codes into applications effectively. He also covers the implementation of managed associations to establish relationships between entities, such as books and their authors, thereby enhancing data integrity and dependencies in the application architecture. The use of VS Code extensions for easy configuration and deployment of CAP services is also highlighted.\n\n### DJ's Private Life\nDuring the livestream, DJ shares snippets of his personal life, such as his recent running habits, his fondness for coffee, and his upcoming travels to Germany for coding events. \n\n### Chat\nViewers actively engage in the chat, posing technical questions and sharing insights about their own experiences with SAP CAP. DJ encourages this interaction, promising to follow up on questions that he can't answer immediately. This community aspect enhances the learning experience, making it more interactive and dynamic."
  },
  {
    "youtubeId": "t5yt4LoO7to",
    "url": "https://www.youtube.com/watch?v=t5yt4LoO7to",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 9",
    "description": "In this episode, we dig in a little more to the managed association based relationship we started to set up between our entities. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!",
    "publishedAt": "2024-04-05T20:08:17Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "2612",
    "likeCount": "44",
    "commentCount": "5",
    "duration": "PT1H36S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.561Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 9\n\nWatch the full session [here](https://www.youtube.com/watch?v=t5yt4LoO7to).\n\nIn this live coding session, DJ Adams dives into the SAP Cloud Application Programming (CAP) model, primarily focusing on associations and how they function within CAP applications. Viewers can gain insights into practical coding skills and stay updated with the latest trends in the SAP ecosystem.\n\n**Main Topics Covered:**\n- Understanding associations in CAP [6m4s](https://www.youtube.com/watch?v=t5yt4LoO7to&t=6m4s)\n- Error handling and debugging in SAP CDS [14m21s](https://www.youtube.com/watch?v=t5yt4LoO7to&t=14m21s)\n- Exploring the differences between managed and unmanaged associations [54m11s](https://www.youtube.com/watch?v=t5yt4LoO7to&t=54m11s)\n- Recap on the March release of CAP updates [13m29s](https://www.youtube.com/watch?v=t5yt4LoO7to&t=13m29s)\n\n## Content\nDJ spends a significant portion of the session explaining different types of associations in CDAS (Core Data Services) and how they influence data retrieval operations. He distinguished between managed and unmanaged associations, emphasizing the importance of foreign key fields and the implications of different design choices within CAP. Additionally, he encourages viewers to interact and share their experiences and challenges while working with the CAP model.\n\n## DJ's Private Life\nDJ shares a lighthearted apology for mistakenly scheduling the live session on the wrong date, reflecting on the misunderstandings that often arise from daylight-saving time changes.\n\n## Chat\nThroughout the stream, viewers actively interacted, sharing their thoughts and asking questions about various topics pertaining to the CAP model. DJ addressed several viewer queries, reinforcing the collaborative learning atmosphere of the session."
  },
  {
    "youtubeId": "BwL_2qAPYsc",
    "url": "https://www.youtube.com/watch?v=BwL_2qAPYsc",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 10",
    "description": "In this episode, we move from exploring associations towards compositions. What's the difference? How are they similar? What do they look like behind the curtain? Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are listed here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-10/ev-p/13660463",
    "publishedAt": "2024-04-12T20:24:22Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "2221",
    "likeCount": "50",
    "commentCount": "17",
    "duration": "PT1H1M50S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.621Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 10\n[Watch the Session](https://www.youtube.com/watch?v=BwL_2qAPYsc)\n\nIn this session, DJ Adams explores the SAP Cloud Application Programming Model (CAP), focusing on the nuances of compositions within the framework. Viewers can expect to gain insights into the core components of CAP, including its structure and usage for building robust backend services for cloud applications.\n\n### Main Topic\n**Main Topics Covered:**\n- Introduction to SAP CAP and its purpose. [2m57s](https://www.youtube.com/watch?v=BwL_2qAPYsc&t=2m57s)\n- Differences between associations and compositions. [4m6s](https://www.youtube.com/watch?v=BwL_2qAPYsc&t=4m6s)\n- The basics of compositions in CAP. [5m42s](https://www.youtube.com/watch?v=BwL_2qAPYsc&t=5m42s)\n- Practical coding examples and the reasoning behind structuring components in CAP. [30m24s](https://www.youtube.com/watch?v=BwL_2qAPYsc&t=30m24s)\n- Discussion of community events and SAP news. [10m11s](https://www.youtube.com/watch?v=BwL_2qAPYsc&t=10m11s)\n\n### Content\nThe session delves deep into the CAP framework, explaining that CAP focuses on providing a structured and maintainable way of creating services, particularly through the use of compositions. DJ discusses how compositions define relationships between parent and child entities, such as in the context of order documents and their associated items. He emphasizes the importance of separating service definitions from the schema, which aids in maintainability. Live coding showcases the transition from a simple service structure to a cleaner organization, implementing essential CAP features such as identifier annotations for data entities.\n\n### DJ's Private Life\nIn a light-hearted moment, DJ shares brief updates from his personal life, expressing his enjoyment of interacting with a global audience while navigating the complexities of coding and SAP environments.\n\n### Chat\nThe session is highly interactive, with viewers in the chat providing insights, questions, and engaging with DJ's explanations. Several viewers contribute ideas on compositions as crucial for modeling complex relationships, such as header-item structures, which yield rich discussions and collaborative learning."
  },
  {
    "youtubeId": "UvkwVGt8L2g",
    "url": "https://www.youtube.com/watch?v=UvkwVGt8L2g",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 11",
    "description": "In this episode, we continue our exploration and understanding of Compositions, looking at auto-exposure of composition targets, cascaded delete and more. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-11/ec-p/13668034#M538",
    "publishedAt": "2024-04-19T20:36:37Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "2079",
    "likeCount": "42",
    "commentCount": "17",
    "duration": "PT1H1M50S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.676Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 11\n\nIn this live coding session, DJ Adams focuses on the SAP Cloud Application Programming Model (CAP) and shares insights on various technical topics while engaging with viewers on YouTube. The session offers valuable learning opportunities related to application development in SAP.\n\n**Main Topics Covered:**\n- [2m0s](https://www.youtube.com/watch?v=UvkwVGt8L2g&t=2m0s): Introduction to CAP and its significance.\n- [5m3s](https://www.youtube.com/watch?v=UvkwVGt8L2g&t=5m3s): Overview of CD and its implementation.\n- [20m0s](https://www.youtube.com/watch?v=UvkwVGt8L2g&t=20m0s): Discussion on Auto exposure in CAP.\n- [24m0s](https://www.youtube.com/watch?v=UvkwVGt8L2g&t=24m0s): Demonstration of deep inserts and updates in CAP applications.\n- [49m0s](https://www.youtube.com/watch?v=UvkwVGt8L2g&t=49m0s): Cascaded delete functionality in CAP.\n\n## Content\nThe live coding session dives deep into the CAP framework, primarily discussing the use of Core Data Services (CDS) and how to effectively manage data exposure through service definitions. DJ provides a practical approach to deep inserts, showcasing how multiple related entities can be created with just one request. He also highlights the auto exposure feature that streamlines how entities are made available within services, along with the crucial cascade delete logic that efficiently manages relationships between entities.\n\n## DJ's private life\nIn between technical discussions, DJ shares snippets of his personal life, mentioning his running activities and interactions with viewers from various locations around the globe, fostering a friendly and engaging community atmosphere.\n\n## Chat\nViewers actively participate in the chat, providing questions and feedback. Some viewers express curiosity about the uniqueness of CAP compared to other frameworks, while others seek clarification on specific coding techniques within CAP, creating an interactive learning environment. They also share their excitement about coding styles, preferences, and personal insights about their development experiences."
  },
  {
    "youtubeId": "oybe9IRku3Q",
    "url": "https://www.youtube.com/watch?v=oybe9IRku3Q",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 12",
    "description": "In this episode, we finish off our look at Compositions with composition of Aspects, and then start to move towards an understanding of custom service implementations. Yes! JavaScript! But super gentle. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-12/ec-p/13675919#M544",
    "publishedAt": "2024-05-03T20:08:46Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "2290",
    "likeCount": "54",
    "commentCount": "8",
    "duration": "PT1H45S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.730Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 12\n[Watch the video](https://www.youtube.com/watch?v=oybe9IRku3Q)\n\nThis session of Live Coding with DJ Adams focuses on SAP Cloud Application Programming Model (CAP), where viewers can learn about development concepts and coding. The live coding covers a variety of technical topics and includes personal anecdotes from DJ’s life.\n\n**Main Topics Covered:**\n- [1m58s](https://www.youtube.com/watch?v=oybe9IRku3Q&t=1m58s) - Introduction and Greetings\n- [4m27s](https://www.youtube.com/watch?v=oybe9IRku3Q&t=4m27s) - Recent Updates on CAP Development\n- [7m34s](https://www.youtube.com/watch?v=oybe9IRku3Q&t=7m34s) - Implementing OData V4 and Associations\n- [18m30s](https://www.youtube.com/watch?v=oybe9IRku3Q&t=18m30s) - Adding Custom Logic and Event Handling\n- [59m41s](https://www.youtube.com/watch?v=oybe9IRku3Q&t=59m41s) - Cliffhanger Ending\n\n## Content\nThe session dives into SAP CAP and explores techniques in OData development, specifically discussing how to establish associations and utilize OData V4 expander functions. DJ explains the implementation of custom logic through JavaScript files in the context of CAP, enabling personalized functionality in applications. Viewers also learn about the relationship between entities and how to create them effectively. The demonstration provides practical examples and coding exercises, which help solidify these concepts.\n\n## DJ's Private Life\nDuring the stream, DJ shares moments from a recent trip to Barcelona with his family, adding a personal touch to the technical discourse. He also discusses enjoying coffee and tea while engaging with the viewers.\n\n## Chat\nThe chat is active with viewers asking questions about coding practices and sharing their experiences with CAP. DJ addresses inquiries, provides advice, and encourages interaction, creating a welcoming environment for both beginners and experienced developers. The community aspect is emphasized, fostering collaboration and learning through shared knowledge."
  },
  {
    "youtubeId": "xQ-fUnpdvgM",
    "url": "https://www.youtube.com/watch?v=xQ-fUnpdvgM",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 13",
    "description": "In this episode we look at the difference between the different standard events for providing custom logic and start to add some logic of our own. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-13/ec-p/13690525",
    "publishedAt": "2024-05-10T20:08:14Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "2119",
    "likeCount": "50",
    "commentCount": "5",
    "duration": "PT1H1M35S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.793Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 13\n\nIn this engaging live coding session, DJ Adams dives deep into the SAP Cloud Application Programming Model (CAP), exploring its features and functionalities. Viewers can expect to learn about coding practices while receiving insights into the SAP ecosystem.\n\n**Main Topics Covered:**\n- [2m0s](https://www.youtube.com/watch?v=xQ-fUnpdvgM&t=2m0s): Introduction & welcome to SAP CAP.\n- [5m40s](https://www.youtube.com/watch?v=xQ-fUnpdvgM&t=5m40s): Overview of the latest CAP features from the April release.\n- [10m0s](https://www.youtube.com/watch?v=xQ-fUnpdvgM&t=10m0s): Implementing custom handlers in CAP.\n- [20m0s](https://www.youtube.com/watch?v=xQ-fUnpdvgM&t=20m0s): The importance of lifecycle events in CAP servers.\n- [30m0s](https://www.youtube.com/watch?v=xQ-fUnpdvgM&t=30m0s): Debugging techniques and tips.\n\n## Content\nDJ elaborates on how to implement custom handlers for CRUD operations within the CAP framework, highlighting the use of console logs to debug various requests. He emphasizes the significance of lifecycle events associated with CAP servers, which is critical for handling HTTP requests effectively. Viewers learn about the various ways to optimize their custom implementations by registering custom handlers that augment the default behavior of the CAP API. DJ also introduces advanced JavaScript features, particularly arrow functions, and their implications for handler functions.\n\n## DJ's Private Life\nDuring the stream, DJ briefly shares that he will be away for a holiday next week, which adds a personal touch to the coding session and connects him with the audience.\n\n## Chat\nThe audience actively participated by asking questions and sharing insights. There were discussions around the nuances of JavaScript, debugging techniques, and the intricacies of the CAP model. DJ engaged with viewers to clarify doubts, creating an interactive learning environment for all participants."
  },
  {
    "youtubeId": "FxOQsg8yc2s",
    "url": "https://www.youtube.com/watch?v=FxOQsg8yc2s",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 15",
    "description": "In this episode we look further into the 'after' handlers, dig in to how they work, look more into the 'each' mechanism and put an example together. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-15/ec-p/13717987#M570",
    "publishedAt": "2024-06-14T20:02:42Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "1630",
    "likeCount": "34",
    "commentCount": "1",
    "duration": "PT1H31S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.904Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 15\n\nWatch the session here: [Back to basics with SAP Cloud Application Programming Model (CAP) - part 15](https://www.youtube.com/watch?v=FxOQsg8yc2s)\n\nIn this session, DJ Adams engages with viewers on SAP Cloud Application Programming Model (CAP) and various coding topics. Participants can gain insights into using CAP effectively, particularly with event handlers, including handling CRUD (Create, Read, Update, Delete) operations in a Node.js environment.\n\n**Main Topics Covered:**\n- Understanding CAP event handlers, including [20m31s](https://www.youtube.com/watch?v=FxOQsg8yc2s&t=20m31s)\n- Using Docker for running CAP applications [12m23s](https://www.youtube.com/watch?v=FxOQsg8yc2s&t=12m23s)\n- Recent updates in SAP ecosystem, including the May 2024 cap release [7m6s](https://www.youtube.com/watch?v=FxOQsg8yc2s&t=7m6s)\n- Modifying data with after handlers [11m1s](https://www.youtube.com/watch?v=FxOQsg8yc2s&t=11m1s)\n- Concepts of pass by value vs. pass by reference [35m15s](https://www.youtube.com/watch?v=FxOQsg8yc2s&t=35m15s)\n\n## Content\nIn this episode, DJ covers the intricacies of using CAP with a focus on after event handlers for modifying entities. These handlers serve as an opportunity for developers to manipulate responses before they are sent to clients. He explains how the data parameter in these handlers allows for the modification of retrieved data, ultimately enabling developers to customize their applications efficiently.\n\n## DJ's Private Life\nDJ Adams shares snippets from his personal life, including his recent attendance at the Code Connect event, where he interacted with other SAP community members and collected stickers, highlighting the fun of community engagement.\n\n## Chat\nThe viewers actively participate in the chat by asking questions regarding the CAP framework, sharing their experiences, and discussing topics like the use of TypeScript and JavaScript. DJ acknowledges viewer contributions, clarifies concepts, and engages in light-hearted banter, forming a community atmosphere that supports learning and sharing among attendees."
  },
  {
    "youtubeId": "gatY3IVPEVA",
    "url": "https://www.youtube.com/watch?v=gatY3IVPEVA",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 16",
    "description": "In this episode we move back to the 'on' event and build a handler for a simple function. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-16/ec-p/13730760",
    "publishedAt": "2024-06-21T20:10:56Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "1581",
    "likeCount": "32",
    "commentCount": "1",
    "duration": "PT59M27S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.967Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 16\n\nIn this live coding session, DJ Adams explores the SAP Cloud Application Programming model (CAP), focusing on how to define and implement functions, handling events, and interacting with viewers about technical concepts and personal insights. \n\n**Main Topics Covered:**\n- Overview of SAP CAP and OData concepts [0m0s](https://www.youtube.com/watch?v=gatY3IVPEVA&t=0m0s)\n- Implementing a simple function for calculating total stock [4m0s](https://www.youtube.com/watch?v=gatY3IVPEVA&t=4m0s)\n- Handling events with CAP such as using `this.on` for custom methods [56m22s](https://www.youtube.com/watch?v=gatY3IVPEVA&t=56m22s)\n\n## Content\nDJ dives deep into SAP CAP while explaining the differences between bound and unbound functions in OData. The episode provides hands-on examples of creating a simple function to calculate the total stock of various books in the catalog. DJ demonstrates how to utilize event handlers effectively to respond to specific requests. Viewers are encouraged to participate by sharing their thoughts and asking questions in the chat, creating an interactive learning environment.\n\n## DJ's Private Life\nDuring the session, DJ shares a glimpse into his personal life, mentioning that he is live from a narrowboat, commenting on the scenery, including nearby sheep and a beautiful sunrise, to engage with the audience in a light-hearted manner.\n\n## Chat\nThe chat is active with viewers providing questions and insights about CAP, such as the handling of actions and functions in OData, as well as best practices in programming. The community interaction enriches the session, fostering a collaborative learning atmosphere that mirrors a classroom environment."
  },
  {
    "youtubeId": "-DorU9SLJSA",
    "url": "https://www.youtube.com/watch?v=-DorU9SLJSA",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 17",
    "description": "In this episode we work on the implementation of the handler for our 'on' event, and dig in to some CQL. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-17/ec-p/13741241",
    "publishedAt": "2024-06-28T20:03:09Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "1098",
    "likeCount": "27",
    "commentCount": "4",
    "duration": "PT58M28S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:21.023Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 17\n\nIn this session of \"Back to basics with SAP Cloud Application Programming Model (CAP) - part 17,\" DJ Adams dives into various aspects of SAP CAP, providing viewers with insights on how to implement coding practices and interact with the SAP ecosystem. The stream contains live coding sessions, discussions on OData, and Q&A from the chat, making it a comprehensive learning experience.\n\n**Main Topics Covered:**\n- [1m58s](https://www.youtube.com/watch?v=-DorU9SLJSA&t=1m58s): Introduction to the session\n- [5m0s](https://www.youtube.com/watch?v=-DorU9SLJSA&t=5m0s): Overview of SAP CAP functionalities\n- [24m21s](https://www.youtube.com/watch?v=-DorU9SLJSA&t=24m21s): Exploring SQL and CQL syntax within the context of CAP\n- [52m57s](https://www.youtube.com/watch?v=-DorU9SLJSA&t=52m57s): Discussion about implementing unbound and bound functions\n\n## Content\n\nDuring the stream, DJ investigates the key features of SAP CAP, with an emphasis on OData services, coding practices, and the nuances of CQN (CAP Query Language). He conducts live coding to demonstrate constructing queries and working with various data types within the SAP environment. DJ elaborates on the differences between bound and unbound functions and encourages the audience to engage with their queries in the chat, promoting a collaborative learning atmosphere.\n\n## DJ's private life\n\nIn addition to technical discussions, DJ shares his struggles with hay fever, humorously noting he has prepared his medications to ensure it doesn't interfere with his live coding session. He also showcases his collection of stickers from SAP events, demonstrating his enthusiasm for community engagement.\n\n## Chat\n\nThe live chat feature adds a dynamic layer to the session, with viewers contributing questions and insights. Many participants express appreciation for the clarity of DJ's explanations, and there are ongoing discussions about specific coding practices and useful resources. DJ engages actively with the chat, making it easy for viewers to follow along and feel part of the conversation. This engagement enhances the learning experience, fostering a sense of community among SAP developers."
  },
  {
    "youtubeId": "0hindK_fQ8c",
    "url": "https://www.youtube.com/watch?v=0hindK_fQ8c",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 18",
    "description": "Now that we're more comfortable with CQL and expressing it in the affordances that the CAP Node.js layer provides for us, we'll define and implement a second function, this time one that's bound to an entity. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-18/ec-p/13745651",
    "publishedAt": "2024-07-05T20:04:57Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "1107",
    "likeCount": "25",
    "commentCount": "1",
    "duration": "PT1H24S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:21.084Z",
    "summary": "# Back to basics with SAP Cloud Application Programming Model (CAP) - part 18\n\nWatch the full session here: [Back to basics with SAP Cloud Application Programming Model (CAP) - part 18](https://www.youtube.com/watch?v=0hindK_fQ8c)\n\nIn this session, DJ Adams conducts a live coding session focusing on the SAP Cloud Application Programming (CAP) model, where viewers can learn about its core components and functionalities. DJ interacts with the audience while providing insights into SAP-related developments.\n\n**Main Topics Covered:**\n- DJ's morning routine and the weather [0m48s](https://www.youtube.com/watch?v=0hindK_fQ8c&t=0m48s)\n- Overview of the SAP developer challenge [6m18s](https://www.youtube.com/watch?v=0hindK_fQ8c&t=6m18s)\n- Implementing functions in CAP, focusing on both bound and unbound functions [50m37s](https://www.youtube.com/watch?v=0hindK_fQ8c&t=50m37s)\n- Q&A session addressing viewers' queries about CAP and coding [17m2s](https://www.youtube.com/watch?v=0hindK_fQ8c&t=17m2s)\n\n## Content\nDJ dives into the technical aspects of the SAP CAP, specifically discussing the implementation of functions like *total stock* and *stock value*. He explains the concept of bound versus unbound functions, providing coding examples. He guides viewers through the creation of a ping service, elaborating on how to submit API endpoints for testing and the importance of handling responses correctly. DJ highlights best practices for coding in the CAP environment while keeping the audience engaged with live Q&A segments.\n\n## DJ's private life\nDJ shares glimpses of his personal life, expressing enjoyment in the sunny weather after a stretch of inclement conditions. He mentions his rooftop solar panels and shares personal anecdotes, creating a warm atmosphere that makes the coding session feel more relatable.\n\n## Chat\nThe live chat is buzzing with interactions, as viewers share their experiences, ask technical questions, and comment on the developer challenge. DJ actively engages with the audience, encouraging feedback and stimulating discussions, which fosters a sense of community among participants."
  },
  {
    "youtubeId": "kuly5wTFhjU",
    "url": "https://www.youtube.com/watch?v=kuly5wTFhjU",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 19",
    "description": "In this episode we continue to understand and explore what we need to implement a bound function, looking at more complex destructuring, the bound entity context passed in the request, and more CQL. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-19/ec-p/13752449",
    "publishedAt": "2024-07-12T20:21:09Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "1031",
    "likeCount": "23",
    "commentCount": "3",
    "duration": "PT1H1M53S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:21.159Z",
    "summary": "# Summary of Live Coding with DJ Adams: Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 19\n\nWatch the full session here: [Back to Basics with SAP Cloud Application Programming Model (CAP) - part 19](https://www.youtube.com/watch?v=kuly5wTFhjU)\n\nIn this live coding session, DJ Adams explores the SAP Cloud Application Programming Model (CAP), focusing on the development, architecture, and implementation strategies. There is ample opportunity for viewers to learn coding techniques, ask questions, and engage in discussions surrounding both technical and personal topics.\n\n**Main Topics Covered:**\n- [1m18s](https://www.youtube.com/watch?v=kuly5wTFhjU&t=1m18s): Hexagonal Architecture in CAP\n- [6m4s](https://www.youtube.com/watch?v=kuly5wTFhjU&t=6m4s): SAP Developer Challenge and participation\n- [6m48s](https://www.youtube.com/watch?v=kuly5wTFhjU&t=6m48s): Querying concepts using JavaScript\n- [51m8s](https://www.youtube.com/watch?v=kuly5wTFhjU&t=51m8s): Handling data retrieval and manipulation in CAP \n\n## Content\nThe session delves into the core elements of the SAP CAP, including its hexagonal architecture and how it supports OData. DJ demonstrates the querying capabilities within CAP using JavaScript and explains how to create, read, update, and delete data efficiently via the CAP model. The discussion also sheds light on specific features of the framework, like bound functions and the significance of destructuring parameters in requests.\n\n## DJ's Private Life\nThroughout the session, DJ shares that he has been experiencing poor weather conditions in England, highlighting how this affects his everyday life, including managing his boat's battery due to lack of solar power.\n\n## Chat\nThe chat is interactive, with viewers sharing their thoughts on participating in the SAP developer challenge and asking DJ various questions about implementation techniques and best practices. Some viewers express appreciation for the coding hints provided during the session, crediting the practical approach to learning in the live stream."
  },
  {
    "youtubeId": "bkZ3YqEgRuM",
    "url": "https://www.youtube.com/watch?v=bkZ3YqEgRuM",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 14",
    "description": "In this episode we move from the 'on' to the 'after' handler concept, examine what such handler functions receive, and start to enhance the data returned. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-14/ec-p/13697489#M561",
    "publishedAt": "2024-05-31T20:13:59Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "1793",
    "likeCount": "32",
    "commentCount": "2",
    "duration": "PT1H49S",
    "definition": "hd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:20.849Z",
    "summary": "# Back to Basics with SAP Cloud Application Programming Model (CAP) - Part 14\n\nIn this live coding session, DJ Adams discusses the SAP Cloud Application Programming Model (CAP) while interacting with viewers on YouTube. You will learn about various CAP concepts and how they are applied, particularly in handling requests and responses through custom handler implementations.\n\n**Main Topics Covered:**\n- Overview of SAP CAP and OData service integration [2m10s](https://www.youtube.com/watch?v=bkZ3YqEgRuM&t=2m10s).\n- The concept and implementation of **after** and **before** handlers [9m4s](https://www.youtube.com/watch?v=bkZ3YqEgRuM&t=9m4s).\n- Working with custom logging mechanisms [20m36s](https://www.youtube.com/watch?v=bkZ3YqEgRuM&t=20m36s).\n- Handling instances of the data that CAP processes [19m16s](https://www.youtube.com/watch?v=bkZ3YqEgRuM&t=19m16s).\n\n## Content\nDJ elaborates on the use of **after handlers** and **before handlers** in CAP, which allow developers to inject custom logic before or after data operations. The session provides practical coding demonstrations, showcasing how to enrich outbound data and handle CRUD operations effectively. The viewers are encouraged to participate via chat, asking questions and sharing insights about their experiences with SAP CAP development.\n\n## DJ's Private Life\nDuring the stream, DJ shares a bit about his personal life, including his experience with allergies and pollen counts affecting him that day, prompting a light-hearted interaction with viewers.\n\n## Chat\nViewer participation is lively, with many engaged in discussions about upcoming events like SAP's code connect week and sharing their own experiences. DJ responds to questions and comments, creating a collaborative environment where the audience feels included and encouraged to learn from each other."
  },
  {
    "youtubeId": "6ODrvrebvF4",
    "url": "https://www.youtube.com/watch?v=6ODrvrebvF4",
    "title": "Back to basics with SAP Cloud Application Programming Model (CAP) - part 20",
    "description": "In this final episode of the series before the summer break, we finish off by defining and implementing a bound action, with a side effect. Everyone welcome, especially beginners, come and join us for friendly chat and curiosity-driven learning-by-doing!\n\nLinks to all resources shared in this episode are to be found in the comments here: https://community.sap.com/t5/sap-community/back-to-basics-with-sap-cloud-application-programming-model-cap-part-20/ec-p/13759023",
    "publishedAt": "2024-07-12T08:23:51Z",
    "channelId": "UCNfmelKDrvRmjYwSi9yvrMg",
    "channelTitle": "SAP Developers",
    "categoryId": "28",
    "liveBroadcastContent": "none",
    "defaultLanguage": "en",
    "defaultAudioLanguage": "en",
    "viewCount": "309",
    "likeCount": "15",
    "commentCount": "0",
    "duration": "PT1H52S",
    "definition": "sd",
    "caption": "false",
    "licensedContent": false,
    "projection": "rectangular",
    "timestamp": "2024-07-19T17:33:21.215Z",
    "summary": ""
  }
]